QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/sysctl.h
#ifndef SYSCTL_H
#define SYSCTL_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C" {
#endif

//*****************************************************************************
//
//! \addtogroup sysctl_api SysCtl
//! @{
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_memmap.h"
#include "inc/hw_nmi.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"
#include "interrupt.h"

//
// Macro used for adding delay between 2 consecutive writes to CLKSRCCTL1
// register.
// Delay = 300 NOPs
//
extern void qx_precise_delay(uint32_t count);
#define SYSCTL_CLKSRCCTL_DELAY qx_precise_delay(36)

//
// Macro used for adding delay between 2 consecutive writes to memory mapped
// register in System control
// Total delay = 3 * (DEVICE_SYSCLK_FREQ / INTOSC1 Freq) + 9
//
#define SYSCTL_REGWRITE_DELAY qx_precise_delay(3)

//*****************************************************************************
//
// Defines for system control functions. Not intended for use by application
// code.
//
//*****************************************************************************

//
// Shifted pattern for WDCR register's WDCHK field.
//
#define SYSCTL_WD_CHKBITS 0x0028U

//
// Keys for WDKEY field. The first enables resets and the second resets.
//
#define SYSCTL_WD_ENRSTKEY 0x0055U
#define SYSCTL_WD_RSTKEY   0x00AAU

//
// Values to help decode peripheral parameter
//
#define SYSCTL_PERIPH_REG_M 0x001FU
#define SYSCTL_PERIPH_REG_S 0x0000U
#define SYSCTL_PERIPH_BIT_M 0x1F00U
#define SYSCTL_PERIPH_BIT_S 0x0008U

//
// Keys for the System control registers write protection
//
#define SYSCTL_REG_KEY 0xA5A50000U
#define SYSCTL_PLL_KEY 0XCAFE0000U

//
// Values to help access shifting of bits
//
#define SYSCTL_TYPE_LOCK_S 0xFU

//
// LPM defines for LPMCR.LPM
//
#define SYSCTL_LPM_IDLE    0x0000U
#define SYSCTL_LPM_STANDBY 0x0001U
#define SYSCTL_LPM_HALT    0x0002U

//
// Default internal oscillator frequency, 10 MHz
//
#define SYSCTL_DEFAULT_OSC_FREQ 10000000U

//
// Mask for SYNCSELECT.SYNCIN
//
#define SYSCTL_SYNCSELECT_SYNCIN_M SYSCTL_SYNCSELECT_EPWM4SYNCIN_M

// Device_cal function which is available in OTP memory
// This function is called in SysCtl_resetPeripheral after resetting
// analog peripherals
//
// #define Device_cal ((void (*)(void))((uintptr_t)0x003faae3))

//*****************************************************************************
//
// The following are values that can be passed to the SysCtl_setClock() API as
// the config parameter.
//
//*****************************************************************************
//
// System clock divider (SYSDIV)
//

// PLL_CLK = OSCCLK_IN * IMULT/ IDIV / ODIV
// CPU_CLK = PLL_CLK / SYSDIV
// WARNINGS: OSCCLK * IMULT/IDIV need at 400Mhz~800Mhz, OSCCLK_IN need at 8Mhz~240Mhz

// WARNINGS: QX C2000 no support FMULT parameter, instead, It add a IDIV parameter

#define SYSCTL_IDIV_M  0x000FUL // Mask for IDIV value in config
#define SYSCTL_IDIV_S  0U       // Shift for IDIV value in config
#define SYSCTL_IDIV(x) (((x) << SYSCTL_IDIV_S) & SYSCTL_IDIV_M)

#define SYSCTL_IMULT_M  0x3F00UL // Mask for IMULT value in config
#define SYSCTL_IMULT_S  8U       // Shift for IMULT value in config
#define SYSCTL_IMULT(x) (((x) << SYSCTL_IMULT_S) & SYSCTL_IMULT_M)

#ifndef DOXYGEN_PDF_IGNORE
#define SYSCTL_ODIV_M  0xF0000UL // Mask for ODIV value in config
#define SYSCTL_ODIV_S  16U       // Shfit for ODIV value in config
#define SYSCTL_ODIV(x) (((x) << SYSCTL_ODIV_S) & SYSCTL_ODIV_M)

#define SYSCTL_SYSDIV_M  0x3F00000UL // Mask for SYSDIV value in config
#define SYSCTL_SYSDIV_S  20U         // Shift for SYSDIV value in config
#define SYSCTL_SYSDIV(x) ((((x) / 2U) << SYSCTL_SYSDIV_S) & SYSCTL_SYSDIV_M)

// Oscillator source
#define SYSCTL_OSCSRC_M 0x30000000UL // Mask for OSCSRC value in config
#define SYSCTL_OSCSRC_S 28U          // Shift for OSCSRC value in config
//! Internal oscillator INTOSC2
#define SYSCTL_OSCSRC_OSC2 0x00000000UL
//! External oscillator (XTAL) in crystal mode
#define SYSCTL_OSCSRC_XTAL 0x10000000U // WARNING: here do not mean 10Mhz clock
//! Internal oscillator INTOSC1
#define SYSCTL_OSCSRC_OSC1 0x20000000UL
//! External oscillator (XTAL) in single-ended mode
#define SYSCTL_OSCSRC_XTAL_SE 0x30000000U

//
// Enable/disable PLL
//
#define SYSCTL_PLL_ENABLE  0x80000000U //!< Enable PLL
#define SYSCTL_PLL_DISABLE 0x00000000U //!< Disable PLL

//
// Number of PLL retries for SW work around
//
#define SYSCTL_PLL_RETRIES         100U  // Number of PLL retries
#define SYSCTL_PLLLOCK_TIMEOUT     2000U // PLL Lock timeout
#define SYSCTL_DCC_COUNTER0_WINDOW 100U  // DCC Counter0 Window
//*****************************************************************************
//
// Values that can be passed to SysCtl_clearNMIStatus(),
// SysCtl_forceNMIFlags(), SysCtl_isNMIFlagSet(), and
// SysCtl_isNMIShadowFlagSet() as the nmiFlags parameter and returned by
// SysCtl_getNMIFlagStatus() and SysCtl_getNMIShadowFlagStatus().
//
//*****************************************************************************
#define SYSCTL_NMI_NMIINT     0x1U    //!< NMI Interrupt Flag
#define SYSCTL_NMI_CLOCKFAIL  0x2U    //!< Clock Fail Interrupt Flag
#define SYSCTL_NMI_RAMUNCERR  0x80U   //!< Data RAM Uncorrectable Error NMI Flag
#define SYSCTL_NMI_FLUNCERR   0x100U  //!< Flash Uncorrectable Error NMI Flag
#define SYSCTL_NMI_IRAMUNCERR 0x200U  //!< Inst RAM Uncorrectable Error NMI Flag
#define SYSCTL_NMI_SWERR      0x2000U //!<  SW Error Force NMI Flag

//*****************************************************************************
//
// The following are values that can be passed to the SysCtl_clearResetCause()
// API as rstCauses or returned by the SysCtl_getResetCause() API.
//
//*****************************************************************************
#ifdef __CORE0__
#define SYSCTL_CAUSE_POR     0x00000001U //!< CPU1 Power-on reset
#define SYSCTL_CAUSE_XRS     0x00000002U //!< CPU1 External reset pin
#define SYSCTL_CAUSE_WDRS    0x00000004U //!< CPU1 Watchdog reset
#define SYSCTL_CAUSE_NMIWDRS 0x00000008U //!< CPU1 NMI watchdog reset
#define SYSCTL_CAUSE_DBGRS   0x00000100U //!< CPU1 Debug reset
#else
#define SYSCTL_CAUSE_POR     0x00000010U //!< CPU2 Power-on reset
#define SYSCTL_CAUSE_XRS     0x00000020U //!< CPU2 External reset pin
#define SYSCTL_CAUSE_WDRS    0x00000040U //!< CPU2 Watchdog reset
#define SYSCTL_CAUSE_NMIWDRS 0x00000080U //!< CPU2 NMI watchdog reset
#define SYSCTL_CAUSE_DBGRS   0x00000200U //!< CPU2 Debug reset
#endif
//*****************************************************************************
//
// The following values define the adcsocSrc parameter for
// SysCtl_enableExtADCSOCSource() and SysCtl_disableExtADCSOCSource().
//
//*****************************************************************************
#define SYSCTL_ADCSOC_SRC_PWM1SOCA 0x1U      //!< ePWM1 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM2SOCA 0x2U      //!< ePWM2 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM3SOCA 0x4U      //!< ePWM3 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM4SOCA 0x8U      //!< ePWM4 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM5SOCA 0x10U     //!< ePWM5 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM6SOCA 0x20U     //!< ePWM6 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM7SOCA 0x40U     //!< ePWM7 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM8SOCA 0x80U     //!< ePWM8 SOCA for ADCSOCAO
#define SYSCTL_ADCSOC_SRC_PWM1SOCB 0x10000U  //!< ePWM1 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM2SOCB 0x20000U  //!< ePWM2 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM3SOCB 0x40000U  //!< ePWM3 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM4SOCB 0x80000U  //!< ePWM4 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM5SOCB 0x100000U //!< ePWM5 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM6SOCB 0x200000U //!< ePWM6 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM7SOCB 0x400000U //!< ePWM7 SOCB for ADCSOCBO
#define SYSCTL_ADCSOC_SRC_PWM8SOCB 0x800000U //!< ePWM8 SOCB for ADCSOCBO
#endif

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_enablePeripheral()
//! and SysCtl_disablePeripheral() as the \e peripheral parameter.
//
//*****************************************************************************
#define SYSCTL_PERIPH_CLK_CPU1 SYSCTL_PERIPH_CLK_CPU2
typedef enum
{
    SYSCTL_PERIPH_CLK_CPU2        = 0x0000, //!< CPU1 clock
    SYSCTL_PERIPH_CLK_DMA         = 0x0200, //!< DMA clock
    SYSCTL_PERIPH_CLK_TIMER0      = 0x0500, //!< CPU1 TIMER0 clock
    SYSCTL_PERIPH_CLK_TIMER1      = 0x0600, //!< CPU1 TIMER1 clock
    SYSCTL_PERIPH_CLK_TIMER2      = 0x0700, //!< CPU1 TIMER2 clock
    SYSCTL_PERIPH_CLK_CPU2_TIMER0 = 0x0800, //!< CPU2 TIMER0 clock
    SYSCTL_PERIPH_CLK_CPU2_TIMER1 = 0x0900, //!< CPU2 TIMER1 clock
    SYSCTL_PERIPH_CLK_CPU2_TIMER2 = 0x0A00, //!< CPU2 TIMER2 clock
    SYSCTL_PERIPH_CLK_HRPWM       = 0x1000, //!< HRPWM clock (no used, just for compatible)
    SYSCTL_PERIPH_CLK_TBCLKSYNC   = 0x1200, //!< TBCLKSYNC clock
    SYSCTL_PERIPH_CLK_EPWM1       = 0x0001, //!< EPWM1 clock
    SYSCTL_PERIPH_CLK_EPWM2       = 0x0101, //!< EPWM2 clock
    SYSCTL_PERIPH_CLK_EPWM3       = 0x0201, //!< EPWM3 clock
    SYSCTL_PERIPH_CLK_EPWM4       = 0x0301, //!< EPWM4 clock
    SYSCTL_PERIPH_CLK_EPWM5       = 0x0401, //!< EPWM5 clock
    SYSCTL_PERIPH_CLK_EPWM6       = 0x0501, //!< EPWM6 clock
    SYSCTL_PERIPH_CLK_EPWM7       = 0x0601, //!< EPWM7 clock
    SYSCTL_PERIPH_CLK_EPWM8       = 0x0701, //!< EPWM8 clock
    SYSCTL_PERIPH_CLK_EPWM9       = 0x0801, //!< EPWM9 clock
    SYSCTL_PERIPH_CLK_EPWM10      = 0x0901, //!< EPWM10 clock
    SYSCTL_PERIPH_CLK_EPWM11      = 0x0A01, //!< EPWM11 clock
    SYSCTL_PERIPH_CLK_EPWM12      = 0x0B01, //!< EPWM12 clock
    SYSCTL_PERIPH_CLK_ECAP1       = 0x0002, //!< ECAP1 clock
    SYSCTL_PERIPH_CLK_ECAP2       = 0x0102, //!< ECAP2 clock
    SYSCTL_PERIPH_CLK_ECAP3       = 0x0202, //!< ECAP3 clock
    SYSCTL_PERIPH_CLK_ECAP4       = 0x0302, //!< ECAP4 clock
    SYSCTL_PERIPH_CLK_ECAP5       = 0x0402, //!< ECAP5 clock
    SYSCTL_PERIPH_CLK_ECAP6       = 0x0502, //!< ECAP6 clock
    SYSCTL_PERIPH_CLK_ECAP7       = 0x0602, //!< ECAP7 clock
    SYSCTL_PERIPH_CLK_EQEP1       = 0x0003, //!< EQEP1 clock
    SYSCTL_PERIPH_CLK_EQEP2       = 0x0103, //!< EQEP2 clock
    SYSCTL_PERIPH_CLK_SD1         = 0x0004, //!< SD1 clock
    SYSCTL_PERIPH_CLK_SCIA        = 0x0005, //!< SCI_A clock
    SYSCTL_PERIPH_CLK_SCIB        = 0x0105, //!< SCI_B clock
    SYSCTL_PERIPH_CLK_SCIC        = 0x0205, //!< SCI_C clock
    SYSCTL_PERIPH_CLK_SPIA        = 0x0006, //!< SPI_A clock
    SYSCTL_PERIPH_CLK_SPIB        = 0x0106, //!< SPI_B clock
    SYSCTL_PERIPH_CLK_I2CA        = 0x0007, //!< I2C_A clock
    SYSCTL_PERIPH_CLK_PMBUSA      = 0x0107, //!< PMBUS_A clock
    SYSCTL_PERIPH_CLK_CANA        = 0x0008, //!< CAN_A clock
    SYSCTL_PERIPH_CLK_CANB        = 0x0108, //!< CAN_B clock
    SYSCTL_PERIPH_CLK_ADCA        = 0x0009, //!< ADC_A clock
    SYSCTL_PERIPH_CLK_ADCB        = 0x0109, //!< ADC_B clock
    SYSCTL_PERIPH_CLK_ADCC        = 0x0209, //!< ADC_C clock
    SYSCTL_PERIPH_CLK_ADCG        = 0x0309, //!< ADC_G clock
    SYSCTL_PERIPH_CLK_ADCH        = 0x0409, //!< ADC_H clock
    SYSCTL_PERIPH_CLK_ADCA_HR     = 0x0609, //!< ADC_A_HR clock
    SYSCTL_PERIPH_CLK_ADCB_HR     = 0x0709, //!< ADC_B_HR clock
    SYSCTL_PERIPH_CLK_ADCC_HR     = 0x0809, //!< ADC_C_HR clock
    SYSCTL_PERIPH_CLK_CMPSS1      = 0x000A, //!< CMPSS1 clock
    SYSCTL_PERIPH_CLK_CMPSS2      = 0x010A, //!< CMPSS2 clock
    SYSCTL_PERIPH_CLK_CMPSS3      = 0x020A, //!< CMPSS3 clock
    SYSCTL_PERIPH_CLK_CMPSS4      = 0x030A, //!< CMPSS4 clock
    SYSCTL_PERIPH_CLK_CMPSS5      = 0x040A, //!< CMPSS5 clock
    SYSCTL_PERIPH_CLK_CMPSS6      = 0x050A, //!< CMPSS6 clock
    SYSCTL_PERIPH_CLK_CMPSS7      = 0x060A, //!< CMPSS7 clock
    SYSCTL_PERIPH_CLK_PGA1        = 0x000B, //!< PGA1 clock
    SYSCTL_PERIPH_CLK_PGA2        = 0x010B, //!< PGA2 clock
    SYSCTL_PERIPH_CLK_PGA3        = 0x020B, //!< PGA3 clock
    SYSCTL_PERIPH_CLK_PGA4        = 0x030B, //!< PGA4 clock
    SYSCTL_PERIPH_CLK_PGA5        = 0x040B, //!< PGA5 clock
    SYSCTL_PERIPH_CLK_PGA6        = 0x050B, //!< PGA6 clock
    SYSCTL_PERIPH_CLK_PGA7        = 0x060B, //!< PGA7 clock
    SYSCTL_PERIPH_CLK_DACA        = 0x000C, //!< DAC_A clock
    SYSCTL_PERIPH_CLK_DACB        = 0x010C, //!< DAC_B clock
    SYSCTL_PERIPH_CLK_LINA        = 0x000D, //!< LIN_A clock
    SYSCTL_PERIPH_CLK_XINTF       = 0x010D, //!< XINTF clock
} SysCtl_PeripheralPCLOCKCR;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_resetPeripheral() as
//! the \e peripheral parameter.
//
//*****************************************************************************
#define SYSCTL_PERIPH_RES_CPU1 SYSCTL_PERIPH_RES_CPU2
typedef enum
{
    SYSCTL_PERIPH_RES_CPU2    = 0x0000, //!< CPU1 reset
    SYSCTL_PERIPH_RES_EPWM1   = 0x0001, //!< EPWM1 reset
    SYSCTL_PERIPH_RES_EPWM2   = 0x0101, //!< EPWM2 reset
    SYSCTL_PERIPH_RES_EPWM3   = 0x0201, //!< EPWM3 reset
    SYSCTL_PERIPH_RES_EPWM4   = 0x0301, //!< EPWM4 reset
    SYSCTL_PERIPH_RES_EPWM5   = 0x0401, //!< EPWM5 reset
    SYSCTL_PERIPH_RES_EPWM6   = 0x0501, //!< EPWM6 reset
    SYSCTL_PERIPH_RES_EPWM7   = 0x0601, //!< EPWM7 reset
    SYSCTL_PERIPH_RES_EPWM8   = 0x0701, //!< EPWM8 reset
    SYSCTL_PERIPH_RES_EPWM9   = 0x0801, //!< EPWM9 reset
    SYSCTL_PERIPH_RES_EPWM10  = 0x0901, //!< EPWM10 reset
    SYSCTL_PERIPH_RES_EPWM11  = 0x0A01, //!< EPWM11 reset
    SYSCTL_PERIPH_RES_EPWM12  = 0x0B01, //!< EPWM12 reset
    SYSCTL_PERIPH_RES_ECAP1   = 0x0002, //!< ECAP1 reset
    SYSCTL_PERIPH_RES_ECAP2   = 0x0102, //!< ECAP2 reset
    SYSCTL_PERIPH_RES_ECAP3   = 0x0202, //!< ECAP3 reset
    SYSCTL_PERIPH_RES_ECAP4   = 0x0302, //!< ECAP4 reset
    SYSCTL_PERIPH_RES_ECAP5   = 0x0402, //!< ECAP5 reset
    SYSCTL_PERIPH_RES_ECAP6   = 0x0502, //!< ECAP6 reset
    SYSCTL_PERIPH_RES_ECAP7   = 0x0602, //!< ECAP7 reset
    SYSCTL_PERIPH_RES_EQEP1   = 0x0003, //!< EQEP1 reset
    SYSCTL_PERIPH_RES_EQEP2   = 0x0103, //!< EQEP2 reset
    SYSCTL_PERIPH_RES_SD1     = 0x0004, //!< SD1 reset
    SYSCTL_PERIPH_RES_SCIA    = 0x0005, //!< SCI_A reset
    SYSCTL_PERIPH_RES_SCIB    = 0x0105, //!< SCI_B reset
    SYSCTL_PERIPH_RES_SCIC    = 0x0205, //!< SCI_C reset
    SYSCTL_PERIPH_RES_SPIA    = 0x0006, //!< SPI_A reset
    SYSCTL_PERIPH_RES_SPIB    = 0x0106, //!< SPI_B reset
    SYSCTL_PERIPH_RES_I2CA    = 0x0007, //!< I2C_A reset
    SYSCTL_PERIPH_RES_PMBUSA  = 0x0107, //!< PMBUS_A reset
    SYSCTL_PERIPH_RES_CANA    = 0x0008, //!< CAN_A reset
    SYSCTL_PERIPH_RES_CANB    = 0x0108, //!< CAN_B reset
    SYSCTL_PERIPH_RES_ADCA    = 0x0009, //!< ADC_A reset
    SYSCTL_PERIPH_RES_ADCB    = 0x0109, //!< ADC_B reset
    SYSCTL_PERIPH_RES_ADCC    = 0x0209, //!< ADC_C reset
    SYSCTL_PERIPH_RES_ADCG    = 0x0309, //!< ADC_G reset
    SYSCTL_PERIPH_RES_ADCH    = 0x0409, //!< ADC_H reset
    SYSCTL_PERIPH_RES_ADCA_HR = 0x0609, //!< ADC_A_HR reset
    SYSCTL_PERIPH_RES_ADCB_HR = 0x0709, //!< ADC_B_HR reset
    SYSCTL_PERIPH_RES_ADCC_HR = 0x0809, //!< ADC_C_HR reset
    SYSCTL_PERIPH_RES_CMPSS1  = 0x000A, //!< CMPSS1 reset
    SYSCTL_PERIPH_RES_CMPSS2  = 0x010A, //!< CMPSS2 reset
    SYSCTL_PERIPH_RES_CMPSS3  = 0x020A, //!< CMPSS3 reset
    SYSCTL_PERIPH_RES_CMPSS4  = 0x030A, //!< CMPSS4 reset
    SYSCTL_PERIPH_RES_CMPSS5  = 0x040A, //!< CMPSS5 reset
    SYSCTL_PERIPH_RES_CMPSS6  = 0x050A, //!< CMPSS6 reset
    SYSCTL_PERIPH_RES_CMPSS7  = 0x060A, //!< CMPSS7 reset
    SYSCTL_PERIPH_RES_PGA1    = 0x000B, //!< PGA1 reset
    SYSCTL_PERIPH_RES_PGA2    = 0x010B, //!< PGA2 reset
    SYSCTL_PERIPH_RES_PGA3    = 0x020B, //!< PGA3 reset
    SYSCTL_PERIPH_RES_PGA4    = 0x030B, //!< PGA4 reset
    SYSCTL_PERIPH_RES_PGA5    = 0x040B, //!< PGA5 reset
    SYSCTL_PERIPH_RES_PGA6    = 0x050B, //!< PGA6 reset
    SYSCTL_PERIPH_RES_PGA7    = 0x060B, //!< PGA7 reset
    SYSCTL_PERIPH_RES_DACA    = 0x000C, //!< DAC_A reset
    SYSCTL_PERIPH_RES_DACB    = 0x010C, //!< DAC_B reset
    SYSCTL_PERIPH_RES_LINA    = 0x000D, //!< LIN_A reset
    SYSCTL_PERIPH_RES_XINTF   = 0x010D, //!< XINTF reset
} SysCtl_PeripheralSOFTPRES;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setWatchdogPredivider() as the \e predivider parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_WD_PREDIV_2    = 0x800, //!< PREDIVCLK = INTOSC1 / 2
    SYSCTL_WD_PREDIV_4    = 0x900, //!< PREDIVCLK = INTOSC1 / 4
    SYSCTL_WD_PREDIV_8    = 0xA00, //!< PREDIVCLK = INTOSC1 / 8
    SYSCTL_WD_PREDIV_16   = 0xB00, //!< PREDIVCLK = INTOSC1 / 16
    SYSCTL_WD_PREDIV_32   = 0xC00, //!< PREDIVCLK = INTOSC1 / 32
    SYSCTL_WD_PREDIV_64   = 0xD00, //!< PREDIVCLK = INTOSC1 / 64
    SYSCTL_WD_PREDIV_128  = 0xE00, //!< PREDIVCLK = INTOSC1 / 128
    SYSCTL_WD_PREDIV_256  = 0xF00, //!< PREDIVCLK = INTOSC1 / 256
    SYSCTL_WD_PREDIV_512  = 0x000, //!< PREDIVCLK = INTOSC1 / 512
    SYSCTL_WD_PREDIV_1024 = 0x100, //!< PREDIVCLK = INTOSC1 / 1024
    SYSCTL_WD_PREDIV_2048 = 0x200, //!< PREDIVCLK = INTOSC1 / 2048
    SYSCTL_WD_PREDIV_4096 = 0x300  //!< PREDIVCLK = INTOSC1 / 4096
} SysCtl_WDPredivider;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setWatchdogPrescaler() as the \e prescaler parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_WD_PRESCALE_1  = 1, //!< WDCLK = PREDIVCLK / 1
    SYSCTL_WD_PRESCALE_2  = 2, //!< WDCLK = PREDIVCLK / 2
    SYSCTL_WD_PRESCALE_4  = 3, //!< WDCLK = PREDIVCLK / 4
    SYSCTL_WD_PRESCALE_8  = 4, //!< WDCLK = PREDIVCLK / 8
    SYSCTL_WD_PRESCALE_16 = 5, //!< WDCLK = PREDIVCLK / 16
    SYSCTL_WD_PRESCALE_32 = 6, //!< WDCLK = PREDIVCLK / 32
    SYSCTL_WD_PRESCALE_64 = 7  //!< WDCLK = PREDIVCLK / 64
} SysCtl_WDPrescaler;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setWatchdogMode() as the \e prescaler parameter.
//
//*****************************************************************************
typedef enum
{
    //! Watchdog can generate a reset signal
    SYSCTL_WD_MODE_RESET,
    //! Watchdog can generate an interrupt signal; reset signal is disabled
    SYSCTL_WD_MODE_INTERRUPT
} SysCtl_WDMode;

//*****************************************************************************
//
//! The following are values that can be passed to SysCtl_setLowSpeedClock() as
//! the \e prescaler parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_LSPCLK_PRESCALE_1  = 0, //!< LSPCLK = SYSCLK / 1
    SYSCTL_LSPCLK_PRESCALE_2  = 1, //!< LSPCLK = SYSCLK / 2
    SYSCTL_LSPCLK_PRESCALE_4  = 2, //!< LSPCLK = SYSCLK / 4 (default)
    SYSCTL_LSPCLK_PRESCALE_6  = 3, //!< LSPCLK = SYSCLK / 6
    SYSCTL_LSPCLK_PRESCALE_8  = 4, //!< LSPCLK = SYSCLK / 8
    SYSCTL_LSPCLK_PRESCALE_10 = 5, //!< LSPCLK = SYSCLK / 10
    SYSCTL_LSPCLK_PRESCALE_12 = 6, //!< LSPCLK = SYSCLK / 12
    SYSCTL_LSPCLK_PRESCALE_14 = 7  //!< LSPCLK = SYSCLK / 14
} SysCtl_LSPCLKPrescaler;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_selectClockOutSource() as the \e source parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_CLOCKOUT_PLLSYS  = 0U, //!< PLL System Clock post SYSCLKDIV
    SYSCTL_CLOCKOUT_PLLRAW  = 1U, //!< PLL Raw Clock
    SYSCTL_CLOCKOUT_SYSCLK  = 2U, //!< CPU System Clock
    SYSCTL_CLOCKOUT_INTOSC1 = 5U, //!< Internal Oscillator 1
    SYSCTL_CLOCKOUT_INTOSC2 = 6U, //!< Internal Oscillator 2
    SYSCTL_CLOCKOUT_XTALOSC = 7U, //!< External Oscillator
} SysCtl_ClockOut;

//*****************************************************************************
//
//! The following are values that can be passed to
//! SysCtl_setExternalOscMode() as the \e mode parameter.
//
//*****************************************************************************
typedef enum
{
    SYSCTL_XTALMODE_CRYSTAL = 1U, //!< XTAL Oscillator Crystal Mode
    SYSCTL_XTALMODE_SINGLE  = 2U  //!< XTAL Oscillator Single-Ended Mode
} SysCtl_ExternalOscMode;

//*****************************************************************************
//
//! The following values define the \e syncInput parameter for
//! SysCtl_setSyncInputConfig().
//
//*****************************************************************************
typedef enum
{
    SYSCTL_SYNC_IN_EPWM4  = 0,  //!< Sync input to EPWM4
    SYSCTL_SYNC_IN_EPWM7  = 3,  //!< Sync input to EPWM7
    SYSCTL_SYNC_IN_EPWM10 = 6,  //!< Sync input to EPWM10
    SYSCTL_SYNC_IN_ECAP1  = 9,  //!< Sync input to ECAP1
    SYSCTL_SYNC_IN_ECAP4  = 12, //!< Sync input to ECAP4
    SYSCTL_SYNC_IN_ECAP6  = 15, //!< Sync input to ECAP6
    SYSCTL_SYNC_IN_EPWM1  = 29  //!< Sync input to EPWM1
} SysCtl_SyncInput;

//*****************************************************************************
//
//! The following values define the \e syncSrc parameter for
//! SysCtl_setSyncInputConfig(). Note that some of these are only valid for
//! certain values of \e syncInput. See device technical reference manual for
//! info on time-base counter synchronization for details.
//
//*****************************************************************************
typedef enum
{
    //! EPWM1SYNCOUT
    SYSCTL_SYNC_IN_SRC_EPWM1SYNCOUT = 0,
    //! EPWM4SYNCOUT
    SYSCTL_SYNC_IN_SRC_EPWM4SYNCOUT = 1,
    //! EPWM7SYNCOUT
    SYSCTL_SYNC_IN_SRC_EPWM7SYNCOUT = 2,
    //! ECAP1SYNCOUT
    SYSCTL_SYNC_IN_SRC_ECAP1SYNCOUT = 4,
    //! EXTSYNCIN1--Valid for all values of syncInput
    SYSCTL_SYNC_IN_SRC_EXTSYNCIN1 = 5,
    //! EXTSYNCIN2--Valid for all values of syncInput
    SYSCTL_SYNC_IN_SRC_EXTSYNCIN2 = 6,
} SysCtl_SyncInputSource;

//*****************************************************************************
//
//! The following values define the \e syncSrc parameter for
//! SysCtl_setSyncOutputConfig().
//
//*****************************************************************************
typedef enum
{
    SYSCTL_SYNC_OUT_SRC_EPWM1SYNCOUT, //!< EPWM1SYNCOUT --> EXTSYNCOUT
    SYSCTL_SYNC_OUT_SRC_EPWM4SYNCOUT, //!< EPWM4SYNCOUT --> EXTSYNCOUT
    SYSCTL_SYNC_OUT_SRC_EPWM7SYNCOUT, //!< EPWM7SYNCOUT --> EXTSYNCOUT
    SYSCTL_SYNC_OUT_SRC_EPWM10SYNCOUT //!< EPWM10SYNCOUT --> EXTSYNCOUT

} SysCtl_SyncOutputSource;

